TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0L1306/msp_subsystems/uart_to_i2c_bridge/ti_msp_dl_config.h
/*
 * Copyright (c) 2023, Texas Instruments Incorporated - http://www.ti.com
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ============ ti_msp_dl_config.h =============
 *  Configured MSPM0 DriverLib module declarations
 *
 *  DO NOT EDIT - This file is generated for the LP_MSPM0L1306
 *  by the SysConfig tool.
 */
#ifndef ti_msp_dl_config_h
#define ti_msp_dl_config_h

#define CONFIG_LP_MSPM0L1306

#if defined(__ti_version__) || defined(__TI_COMPILER_VERSION__)
#define SYSCONFIG_WEAK __attribute__((weak))
#elif defined(__IAR_SYSTEMS_ICC__)
#define SYSCONFIG_WEAK __weak
#elif defined(__GNUC__)
#define SYSCONFIG_WEAK __attribute__((weak))
#endif

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/driverlib.h>
#include <ti/driverlib/m0p/dl_core.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
 *  ======== SYSCFG_DL_init ========
 *  Perform all required MSP DL initialization
 *
 *  This function should be called once at a point before any use of
 *  MSP DL.
 */


/* clang-format off */

#define POWER_STARTUP_DELAY                                                (16)



#define CPUCLK_FREQ                                                     32000000




/* Defines for I2C_BRIDGE */
#define I2C_BRIDGE_INST                                                     I2C0
#define I2C_BRIDGE_INST_IRQHandler                               I2C0_IRQHandler
#define I2C_BRIDGE_INST_INT_IRQN                                   I2C0_INT_IRQn
#define I2C_BRIDGE_BUS_SPEED_HZ                                           100000
#define GPIO_I2C_BRIDGE_SDA_PORT                                           GPIOA
#define GPIO_I2C_BRIDGE_SDA_PIN                                    DL_GPIO_PIN_0
#define GPIO_I2C_BRIDGE_IOMUX_SDA                                 (IOMUX_PINCM1)
#define GPIO_I2C_BRIDGE_IOMUX_SDA_FUNC                  IOMUX_PINCM1_PF_I2C0_SDA
#define GPIO_I2C_BRIDGE_SCL_PORT                                           GPIOA
#define GPIO_I2C_BRIDGE_SCL_PIN                                    DL_GPIO_PIN_1
#define GPIO_I2C_BRIDGE_IOMUX_SCL                                 (IOMUX_PINCM2)
#define GPIO_I2C_BRIDGE_IOMUX_SCL_FUNC                  IOMUX_PINCM2_PF_I2C0_SCL


/* Defines for UART_BRIDGE */
#define UART_BRIDGE_INST                                                   UART0
#define UART_BRIDGE_INST_IRQHandler                             UART0_IRQHandler
#define UART_BRIDGE_INST_INT_IRQN                                 UART0_INT_IRQn
#define GPIO_UART_BRIDGE_RX_PORT                                           GPIOA
#define GPIO_UART_BRIDGE_TX_PORT                                           GPIOA
#define GPIO_UART_BRIDGE_RX_PIN                                    DL_GPIO_PIN_9
#define GPIO_UART_BRIDGE_TX_PIN                                    DL_GPIO_PIN_8
#define GPIO_UART_BRIDGE_IOMUX_RX                                (IOMUX_PINCM10)
#define GPIO_UART_BRIDGE_IOMUX_TX                                 (IOMUX_PINCM9)
#define GPIO_UART_BRIDGE_IOMUX_RX_FUNC                 IOMUX_PINCM10_PF_UART0_RX
#define GPIO_UART_BRIDGE_IOMUX_TX_FUNC                  IOMUX_PINCM9_PF_UART0_TX
#define UART_BRIDGE_BAUD_RATE                                             (9600)
#define UART_BRIDGE_IBRD_32_MHZ_9600_BAUD                                  (208)
#define UART_BRIDGE_FBRD_32_MHZ_9600_BAUD                                   (21)



/* clang-format on */

void SYSCFG_DL_init(void);
void SYSCFG_DL_initPower(void);
void SYSCFG_DL_GPIO_init(void);
void SYSCFG_DL_SYSCTL_init(void);
void SYSCFG_DL_I2C_BRIDGE_init(void);
void SYSCFG_DL_UART_BRIDGE_init(void);


#ifdef __cplusplus
}
#endif

#endif /* ti_msp_dl_config_h */
